Revit 2026 API

# LoadCombinationCreate(Document, String, LoadCombinationType, LoadCombinationState) Method

---

Creates a new LoadCombination.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static LoadCombination Create(
	Document document,
	string name,
	LoadCombinationType type,
	LoadCombinationState state
)
```
```vb
Public Shared Function Create (
	document As Document,
	name As String,
	type As LoadCombinationType,
	state As LoadCombinationState
) As LoadCombination
```
```cpp
public:
static LoadCombination^ Create(
	Document^ document,
	String^ name,
	LoadCombinationType type,
	LoadCombinationState state
)
```
```fsharp
static member Create :
        document : Document *
        name : string *
        type : LoadCombinationType *
        state : LoadCombinationState -> LoadCombination
```

#### Parameters

document Document
     The Document to which new load combination element will be added.
name String
     The name of the load combination.
type LoadCombinationType
     The type of the load combination.
state LoadCombinationState
     The state of the load combination.

#### Return Value

LoadCombination The newly created load combination element if successful,  otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | The given name is not unique |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

LoadCombination Class

Create Overload

Autodesk.Revit.DB.Structure Namespace